
--1. แสดงจำนวนสินค้าในร้านรหัส shop5


--2. แสดงจำนวนลูกค้าที่ได้รับการแนะนำจากลูกค้ารหัส c44


--3. สินค้ารหัส p88 ขายได้แล้วทั้งหมดกี่ชิ้น


--4. แสดงราคาสินค้าที่ถูกที่สุด ของร้านค้ารหัส s1


--5. แสดงข้อมูลสินค้า ที่สามารถใช้ point ในการแลกซื้อได้


--6. แสดงรหัสการสั่งซื้อ และยอดซื้อรวมหลังจากใช้ point ลดราคาแล้ว ของการสั่งซื้อในปี 2020


--7. แสดงการสั่งซื้อทุกรายการในปี 2022


--8. แสดง ปี และยอดรวมการสั่งซื้อในแต่ละปี


--9. การสั่งซื้อรหัส 3 ใช้เวลาในการจัดการสั่งซื้อทั้งหมดกี่วัน


--10. แสดงการสั่งซื้อที่ใช้ point เป็นส่วนลดมากกว่า 100  point


--11. การสั่งซื้อใดบ้างที่ใช้เวลาในการจัดส่งมากกว่า 1 เดือน


--12. แสดงข้อมูลการสั่งซื้อของเดือนนี้


--13. แสดงข้อมูลการสั่งซื้อของเดือนที่แล้ว
